originter2D/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    atmosphere
    {
        type           zeroGradient;
        /*
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0;
        */
    }

    walls
    {
        type           constantAlphaContactAngle;
        theta0         70.3;
        limit          gradient;
        value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
